7767517
43 46
Input                    input0                   0 1 input0 0=94 1=24 2=3 -23328=1,0 -23329=1,128.281006
Convolution              Conv_0                   1 1 input0 108 0=64 1=3 5=1 6=1728 20=1 21=110 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,50.130074
PReLU                    LeakyRelu_1              1 1 108 65 20=1 21=28457 22=14 23=2 -23328=1,1 -23329=1,87.070000
Split                    splitncnn_0              1 2 65 65_splitncnn_0 65_splitncnn_1 -23328=1,1 -23329=2,87.070000,87.070000
Pooling                  MaxPool_2                1 1 65_splitncnn_1 66 1=3 5=1 20=1 21=21530 22=15 -23328=1,1 -23329=1,57.209229
Convolution              Conv_3                   1 1 66 67 0=32 1=1 5=1 6=2048 20=1 21=118 22=15 24=2 25=1 -23328=1,1 -23329=1,23.253157
ReLU                     Relu_4                   1 1 67 68 20=1 21=20851 22=14 23=1 -23328=1,1 -23329=1,29.593422
Convolution              Conv_5                   1 1 68 69 0=32 1=1 11=3 14=1 5=1 6=3072 20=1 21=91 22=15 24=2 25=1 -23328=1,1 -23329=1,12.165761
ReLU                     Relu_6                   1 1 69 70 20=1 21=31145 22=15 23=1 -23328=1,1 -23329=1,11.563566
Convolution              Conv_7                   1 1 70 71 0=32 1=3 11=1 4=1 14=0 5=1 6=3072 20=1 21=231 22=15 24=2 25=1 -23328=1,1 -23329=1,6.424089
ReLU                     Relu_8                   1 1 71 72 20=1 21=32434 22=15 23=1 -23328=1,1 -23329=1,6.358870
Convolution              Conv_9                   1 1 72 111 0=128 1=1 5=1 6=4096 20=1 21=1177 22=15 24=2 25=1 -23328=1,1 -23329=1,14.854349
PReLU                    LeakyRelu_10             1 1 111 75 20=1 21=26411 22=13 23=2 -23328=1,1 -23329=1,47.889507
Split                    splitncnn_1              1 2 75 75_splitncnn_0 75_splitncnn_1 -23328=1,1 -23329=2,47.889507,47.889507
Pooling                  MaxPool_11               1 1 75_splitncnn_1 76 1=3 2=2 12=1 5=1 20=1 21=32516 22=15 -23328=1,1 -23329=1,47.522537
Convolution              Conv_12                  1 1 76 77 0=64 1=1 5=1 6=8192 20=1 21=194 22=15 24=2 25=1 -23328=1,1 -23329=1,46.780872
ReLU                     Relu_13                  1 1 77 78 20=1 21=27927 22=15 23=1 -23328=1,1 -23329=1,39.870846
Convolution              Conv_14                  1 1 78 79 0=64 1=1 11=3 14=1 5=1 6=12288 20=1 21=118 22=15 24=2 25=1 -23328=1,1 -23329=1,26.373219
ReLU                     Relu_15                  1 1 79 80 20=1 21=31985 22=15 23=1 -23328=1,1 -23329=1,25.743410
Convolution              Conv_16                  1 1 80 81 0=64 1=3 11=1 4=1 14=0 5=1 6=12288 20=1 21=96 22=15 24=2 25=1 -23328=1,1 -23329=1,15.332933
ReLU                     Relu_17                  1 1 81 82 20=1 21=25286 22=15 23=1 -23328=1,1 -23329=1,11.832430
Convolution              Conv_18                  1 1 82 114 0=256 1=1 5=1 6=16384 20=1 21=143 22=15 24=2 25=1 -23328=1,1 -23329=1,45.501995
PReLU                    LeakyRelu_19             1 1 114 85 20=1 21=16910 22=13 23=2 -23328=1,1 -23329=1,93.928284
Convolution              Conv_20                  1 1 85 86 0=64 1=1 5=1 6=16384 20=1 21=142 22=15 24=2 25=1 -23328=1,1 -23329=1,88.253777
ReLU                     Relu_21                  1 1 86 87 20=1 21=20824 22=15 23=1 -23328=1,1 -23329=1,56.087772
Convolution              Conv_22                  1 1 87 88 0=64 1=1 11=3 14=1 5=1 6=12288 20=1 21=178 22=15 24=2 25=1 -23328=1,1 -23329=1,51.640797
ReLU                     Relu_23                  1 1 88 89 20=1 21=29793 22=15 23=1 -23328=1,1 -23329=1,46.953789
Convolution              Conv_24                  1 1 89 90 0=64 1=3 11=1 4=1 14=0 5=1 6=12288 20=1 21=75 22=15 24=2 25=1 -23328=1,1 -23329=1,18.663137
ReLU                     Relu_25                  1 1 90 91 20=1 21=28547 22=15 23=1 -23328=1,1 -23329=1,16.259470
Convolution              Conv_26                  1 1 91 117 0=256 1=1 5=1 6=16384 20=1 21=94 22=15 24=2 25=1 -23328=1,1 -23329=1,10.217600
PReLU                    LeakyRelu_27             1 1 117 94 20=1 21=17519 22=12 23=2 -23328=1,1 -23329=1,43.702328
Split                    splitncnn_2              1 2 94 94_splitncnn_0 94_splitncnn_1 -23328=1,1 -23329=2,43.702328,43.702328
Pooling                  MaxPool_28               1 1 94_splitncnn_1 95 1=3 2=2 12=1 5=1 20=1 21=18245 22=14 -23328=1,1 -23329=1,48.666046
Convolution              Conv_29                  1 1 95 120 0=256 1=4 11=1 5=1 6=262144 20=1 21=39 22=15 24=2 25=1 -23328=1,1 -23329=1,8.456701
PReLU                    LeakyRelu_30             1 1 120 98 20=1 21=28484 22=13 23=2 -23328=1,1 -23329=1,29.404362
Convolution              Conv_31                  1 1 98 123 0=68 1=1 11=13 5=1 6=226304 20=1 21=16 22=15 24=2 25=1 -23328=1,1 -23329=1,3.809462
PReLU                    LeakyRelu_32             1 1 123 101 20=1 21=21884 22=12 23=2 -23328=1,1 -23329=1,20.352692
Pooling                  MaxPool_33               1 1 65_splitncnn_0 102 1=5 2=5 5=1 20=1 21=7659 22=15 -23328=1,1 -23329=1,20.352692
Pooling                  MaxPool_34               1 1 75_splitncnn_0 103 1=5 2=5 5=1 20=1 21=13926 22=15 -23328=1,1 -23329=1,20.352692
Pooling                  MaxPool_35               1 1 94_splitncnn_0 104 1=10 11=4 2=2 12=4 5=1 -23328=1,0 -23329=1,20.352692
Concat                   Concat_36                4 1 102 103 104 101 105 -23328=1,1 -23329=1,20.352692
Convolution              Conv_37                  1 1 105 106 0=68 1=1 5=1 6=35088 20=1 21=23 22=15 24=2 25=1 -23328=1,1 -23329=1,1.279228
Reduction                ReduceMean_38            1 1 106 output0 0=3 1=0 -23303=1,1 -23328=1,0 -23329=1,1.783271
