7767517
43 46
Input            input0                   0 1 input0 0=94 1=24 2=3
Convolution      Conv_0                   1 1 input0 108 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
ReLU             LeakyRelu_1              1 1 108 65 0=1.000000e-02
Split            splitncnn_0              1 2 65 65_splitncnn_0 65_splitncnn_1
Pooling          MaxPool_2                1 1 65_splitncnn_1 66 0=0 1=3 11=3 2=1 12=1 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_3                   1 1 66 67 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             Relu_4                   1 1 67 68
Convolution      Conv_5                   1 1 68 69 0=32 1=1 11=3 2=1 12=1 3=1 13=1 4=0 14=1 15=0 16=1 5=1 6=3072
ReLU             Relu_6                   1 1 69 70
Convolution      Conv_7                   1 1 70 71 0=32 1=3 11=1 2=1 12=1 3=1 13=1 4=1 14=0 15=1 16=0 5=1 6=3072
ReLU             Relu_8                   1 1 71 72
Convolution      Conv_9                   1 1 72 111 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             LeakyRelu_10             1 1 111 75 0=1.000000e-02
Split            splitncnn_1              1 2 75 75_splitncnn_0 75_splitncnn_1
Pooling          MaxPool_11               1 1 75_splitncnn_1 76 0=0 1=3 11=3 2=2 12=1 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_12                  1 1 76 77 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             Relu_13                  1 1 77 78
Convolution      Conv_14                  1 1 78 79 0=64 1=1 11=3 2=1 12=1 3=1 13=1 4=0 14=1 15=0 16=1 5=1 6=12288
ReLU             Relu_15                  1 1 79 80
Convolution      Conv_16                  1 1 80 81 0=64 1=3 11=1 2=1 12=1 3=1 13=1 4=1 14=0 15=1 16=0 5=1 6=12288
ReLU             Relu_17                  1 1 81 82
Convolution      Conv_18                  1 1 82 114 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_19             1 1 114 85 0=1.000000e-02
Convolution      Conv_20                  1 1 85 86 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             Relu_21                  1 1 86 87
Convolution      Conv_22                  1 1 87 88 0=64 1=1 11=3 2=1 12=1 3=1 13=1 4=0 14=1 15=0 16=1 5=1 6=12288
ReLU             Relu_23                  1 1 88 89
Convolution      Conv_24                  1 1 89 90 0=64 1=3 11=1 2=1 12=1 3=1 13=1 4=1 14=0 15=1 16=0 5=1 6=12288
ReLU             Relu_25                  1 1 90 91
Convolution      Conv_26                  1 1 91 117 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_27             1 1 117 94 0=1.000000e-02
Split            splitncnn_2              1 2 94 94_splitncnn_0 94_splitncnn_1
Pooling          MaxPool_28               1 1 94_splitncnn_1 95 0=0 1=3 11=3 2=2 12=1 3=0 13=0 14=0 15=0 5=1
Convolution      Conv_29                  1 1 95 120 0=256 1=4 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
ReLU             LeakyRelu_30             1 1 120 98 0=1.000000e-02
Convolution      Conv_31                  1 1 98 123 0=68 1=1 11=13 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=226304
ReLU             LeakyRelu_32             1 1 123 101 0=1.000000e-02
Pooling          MaxPool_33               1 1 65_splitncnn_0 102 0=0 1=5 11=5 2=5 12=5 3=0 13=0 14=0 15=0 5=1
Pooling          MaxPool_34               1 1 75_splitncnn_0 103 0=0 1=5 11=5 2=5 12=5 3=0 13=0 14=0 15=0 5=1
Pooling          MaxPool_35               1 1 94_splitncnn_0 104 0=0 1=10 11=4 2=2 12=4 3=0 13=0 14=0 15=0 5=1
Concat           Concat_36                4 1 102 103 104 101 105 0=0
Convolution      Conv_37                  1 1 105 106 0=68 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=35088
Reduction        ReduceMean_38            1 1 106 output0 0=3 1=0 -23303=1,1 4=0 5=1
