7767517
43 46
Input                    input0                   0 1 input0 0=94 1=24 2=3 -23328=1,875836722 -23329=1,128.281006
Convolution              Conv_0                   1 1 input0 108 0=64 1=3 5=1 6=1728 20=1 21=64 22=15 24=2 25=1 -23328=1,1 -23329=1,27.182865
PReLU                    LeakyRelu_1              1 1 108 65 20=1 21=25943 22=13 23=2 -23328=1,1 -23329=1,86.083130
Split                    splitncnn_0              1 2 65 65_splitncnn_0 65_splitncnn_1 -23328=1,1 -23329=2,86.083130,86.083130
Pooling                  MaxPool_2                1 1 65_splitncnn_1 66 1=3 5=1 20=1 21=19145 22=15 -23328=1,1 -23329=1,50.295246
Convolution              Conv_3                   1 1 66 67 0=32 1=1 5=1 6=2048 20=1 21=81 22=15 24=2 25=1 -23328=1,1 -23329=1,13.230382
ReLU                     Relu_4                   1 1 67 68 20=1 21=25746 22=14 23=1 -23328=1,1 -23329=1,20.790035
Convolution              Conv_5                   1 1 68 69 0=32 1=1 11=3 14=1 5=1 6=3072 20=1 21=126 22=15 24=2 25=1 -23328=1,1 -23329=1,9.462184
ReLU                     Relu_6                   1 1 69 70 20=1 21=17860 22=14 23=1 -23328=1,1 -23329=1,10.314765
Convolution              Conv_7                   1 1 70 71 0=32 1=3 11=1 4=1 14=0 5=1 6=3072 20=1 21=89 22=15 24=2 25=1 -23328=1,1 -23329=1,2.155457
ReLU                     Relu_8                   1 1 71 72 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,2.155457
Convolution              Conv_9                   1 1 72 111 0=128 1=1 5=1 6=4096 20=1 21=273 22=15 24=2 25=1 -23328=1,1 -23329=1,1.000358
PReLU                    LeakyRelu_10             1 1 111 75 20=1 21=26866 22=11 23=2 -23328=1,1 -23329=1,13.123050
Split                    splitncnn_1              1 2 75 75_splitncnn_0 75_splitncnn_1 -23328=1,1 -23329=2,13.123050,13.123050
Pooling                  MaxPool_11               1 1 75_splitncnn_1 76 1=3 2=2 12=1 5=1 20=1 21=18875 22=15 -23328=1,1 -23329=1,7.559505
Convolution              Conv_12                  1 1 76 77 0=64 1=1 5=1 6=8192 20=1 21=-2147483648 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,inf
ReLU                     Relu_13                  1 1 77 78 20=1 21=-2147483648 22=15 23=1 -23328=1,1 -23329=1,inf
Convolution              Conv_14                  1 1 78 79 0=64 1=1 11=3 14=1 5=1 6=12288 20=1 21=-2147483648 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,inf
ReLU                     Relu_15                  1 1 79 80 20=1 21=-2147483648 22=15 23=1 -23328=1,1 -23329=1,inf
Convolution              Conv_16                  1 1 80 81 0=64 1=3 11=1 4=1 14=0 5=1 6=12288 20=1 21=-2147483648 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,inf
ReLU                     Relu_17                  1 1 81 82 20=1 21=-2147483648 22=15 23=1 -23328=1,1 -23329=1,inf
Convolution              Conv_18                  1 1 82 114 0=256 1=1 5=1 6=16384 20=1 21=-2147483648 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,inf
PReLU                    LeakyRelu_19             1 1 114 85 20=1 21=-2147483648 22=15 23=2 -23328=1,1 -23329=1,inf
Convolution              Conv_20                  1 1 85 86 0=64 1=1 5=1 6=16384 20=1 21=-2147483648 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,inf
ReLU                     Relu_21                  1 1 86 87 20=1 21=-2147483648 22=15 23=1 -23328=1,1 -23329=1,inf
Convolution              Conv_22                  1 1 87 88 0=64 1=1 11=3 14=1 5=1 6=12288 20=1 21=-2147483648 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,inf
ReLU                     Relu_23                  1 1 88 89 20=1 21=-2147483648 22=15 23=1 -23328=1,1 -23329=1,inf
Convolution              Conv_24                  1 1 89 90 0=64 1=3 11=1 4=1 14=0 5=1 6=12288 20=1 21=-2147483648 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,inf
ReLU                     Relu_25                  1 1 90 91 20=1 21=-2147483648 22=15 23=1 -23328=1,1 -23329=1,inf
Convolution              Conv_26                  1 1 91 117 0=256 1=1 5=1 6=16384 20=1 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,228742.468750
PReLU                    LeakyRelu_27             1 1 117 94 20=1 21=32767 22=15 23=2 -23328=1,1 -23329=1,228742.468750
Split                    splitncnn_2              1 2 94 94_splitncnn_0 94_splitncnn_1 -23328=1,1 -23329=2,228742.468750,228742.468750
Pooling                  MaxPool_28               1 1 94_splitncnn_1 95 1=3 2=2 12=1 5=1 20=1 21=32767 22=15 -23328=1,1 -23329=1,228742.468750
Convolution              Conv_29                  1 1 95 120 0=256 1=4 11=1 5=1 6=262144 20=1 21=-2147483648 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,inf
PReLU                    LeakyRelu_30             1 1 120 98 20=1 21=-2147483648 22=15 23=2 -23328=1,1 -23329=1,inf
Convolution              Conv_31                  1 1 98 123 0=68 1=1 11=13 5=1 6=226304 20=1 22=15 24=2 25=1 26=-2147483648 27=-2147483648 -23328=1,1 -23329=1,303.653137
PReLU                    LeakyRelu_32             1 1 123 101 20=1 21=822 22=15 23=2 -23328=1,1 -23329=1,7.614218
Pooling                  MaxPool_33               1 1 65_splitncnn_0 102 1=5 2=5 5=1 20=1 21=2898 22=15 -23328=1,1 -23329=1,7.614218
Pooling                  MaxPool_34               1 1 75_splitncnn_0 103 1=5 2=5 5=1 20=1 21=19012 22=15 -23328=1,1 -23329=1,7.614218
Pooling                  MaxPool_35               1 1 94_splitncnn_0 104 1=10 11=4 2=2 12=4 5=1 -23328=1,0 -23329=1,7.614218
Concat                   Concat_36                4 1 102 103 104 101 105 -23328=1,1 -23329=1,7.614218
Convolution              Conv_37                  1 1 105 106 0=68 1=1 5=1 6=35088 20=1 21=37 22=15 24=2 25=1 -23328=1,1 -23329=1,0.637965
Reduction                d            1 1 106 output0 0=3 1=0 -23303=1,1 -23328=1,0 -23329=1,1.144675
