7767517
44 47
Input                    input0                   0 1 input0 0=94 1=24 2=3 -23328=1,0 -23329=1,128.281006
Convolution              Conv_0                   1 1 input0 109 0=64 1=3 5=1 6=1728 20=1 21=87 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,39.711113
PReLU                    LeakyRelu_1              1 1 109 65 20=1 21=20155 22=13 23=2 -23328=1,1 -23329=1,97.700050
Split                    splitncnn_0              1 2 65 65_splitncnn_0 65_splitncnn_1 -23328=1,1 -23329=2,97.700050,97.700050
Pooling                  MaxPool_2                1 1 65_splitncnn_1 66 1=3 5=1 20=1 21=18601 22=15 -23328=1,1 -23329=1,55.460369
Convolution              Conv_3                   1 1 66 67 0=32 1=1 5=1 6=2048 20=1 21=81 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,25.887444
ReLU                     Relu_4                   1 1 67 68 20=1 21=20799 22=14 23=1 -23328=1,1 -23329=1,32.864006
Convolution              Conv_5                   1 1 68 69 0=32 1=1 11=3 14=1 5=1 6=3072 20=1 21=127 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,25.009893
ReLU                     Relu_6                   1 1 69 70 20=1 21=32631 22=15 23=1 -23328=1,1 -23329=1,24.906319
Convolution              Conv_7                   1 1 70 71 0=32 1=3 11=1 4=1 14=0 5=1 6=3072 20=1 21=116 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,12.212623
ReLU                     Relu_8                   1 1 71 72 20=1 21=27085 22=15 23=1 -23328=1,1 -23329=1,10.094827
Convolution              Conv_9                   1 1 72 112 0=128 1=1 5=1 6=4096 20=1 21=1642 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,37.132362
PReLU                    LeakyRelu_10             1 1 112 75 20=1 21=27914 22=13 23=2 -23328=1,1 -23329=1,126.526360
Split                    splitncnn_1              1 2 75 75_splitncnn_0 75_splitncnn_1 -23328=1,1 -23329=2,126.526360,126.526360
Pooling                  MaxPool_11               1 1 75_splitncnn_1 76 1=3 2=2 12=1 5=1 20=1 21=28825 22=15 -23328=1,1 -23329=1,111.305145
Convolution              Conv_12                  1 1 76 77 0=64 1=1 5=1 6=8192 20=1 21=64 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,44.596294
ReLU                     Relu_13                  1 1 77 78 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,44.596294
Convolution              Conv_14                  1 1 78 79 0=64 1=1 11=3 14=1 5=1 6=12288 20=1 21=53 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,18.695663
ReLU                     Relu_15                  1 1 79 80 20=1 21=32767 22=15 23=1 -23328=1,1 -23329=1,18.695663
Convolution              Conv_16                  1 1 80 81 0=64 1=3 11=1 4=1 14=0 5=1 6=12288 20=1 21=55 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,6.565074
ReLU                     Relu_17                  1 1 81 82 20=1 21=16437 22=14 23=1 -23328=1,1 -23329=1,6.586217
Convolution              Conv_18                  1 1 82 115 0=256 1=1 5=1 6=16384 20=1 21=790 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,71.445641
PReLU                    LeakyRelu_19             1 1 115 85 20=1 21=20150 22=14 23=2 -23328=1,1 -23329=1,87.866173
Convolution              Conv_20                  1 1 85 86 0=64 1=1 5=1 6=16384 20=1 21=64 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,50.149269
ReLU                     Relu_21                  1 1 86 87 20=1 21=31073 22=15 23=1 -23328=1,1 -23329=1,47.556740
Convolution              Conv_22                  1 1 87 88 0=64 1=1 11=3 14=1 5=1 6=12288 20=1 21=95 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,32.995514
ReLU                     Relu_23                  1 1 88 89 20=1 21=28470 22=15 23=1 -23328=1,1 -23329=1,28.668234
Convolution              Conv_24                  1 1 89 90 0=64 1=3 11=1 4=1 14=0 5=1 6=12288 20=1 21=45 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,8.306990
ReLU                     Relu_25                  1 1 90 91 20=1 21=18174 22=14 23=1 -23328=1,1 -23329=1,9.214315
Convolution              Conv_26                  1 1 91 118 0=256 1=1 5=1 6=16384 20=1 21=122 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,7.494936
PReLU                    LeakyRelu_27             1 1 118 94 20=1 21=20161 22=12 23=2 -23328=1,1 -23329=1,36.891418
Split                    splitncnn_2              1 2 94 94_splitncnn_0 94_splitncnn_1 -23328=1,1 -23329=2,36.891418,36.891418
Pooling                  MaxPool_28               1 1 94_splitncnn_1 95 1=3 2=2 12=1 5=1 20=1 21=32767 22=15 -23328=1,1 -23329=1,36.891418
Convolution              Conv_29                  1 1 95 121 0=256 1=4 11=1 5=1 6=262144 20=1 21=32 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,6.160862
PReLU                    LeakyRelu_30             1 1 121 98 20=1 21=23654 22=12 23=2 -23328=1,1 -23329=1,35.579018
Convolution              Conv_31                  1 1 98 124 0=68 1=1 11=13 5=1 6=226304 20=1 21=16 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,3.286973
PReLU                    LeakyRelu_32             1 1 124 101 20=1 21=26640 22=13 23=2 -23328=1,1 -23329=1,10.688945
Pooling                  MaxPool_33               1 1 65_splitncnn_0 102 1=5 2=5 5=1 20=1 21=3585 22=15 -23328=1,1 -23329=1,10.688945
Pooling                  MaxPool_34               1 1 75_splitncnn_0 103 1=5 2=5 5=1 20=1 21=2768 22=15 -23328=1,1 -23329=1,10.688945
Pooling                  MaxPool_35               1 1 94_splitncnn_0 104 1=10 11=4 2=2 12=4 5=1 -23328=1,0 -23329=1,10.688945
Concat                   Concat_36                4 1 102 103 104 101 105 -23328=1,1 -23329=1,10.688945
Convolution              Conv_37                  1 1 105 106 0=68 1=1 5=1 6=35088 20=1 21=35 22=15 23=0 24=2 25=1 -23328=1,1 -23329=1,1.779006
Reduction                ReduceMean_38            1 1 106 107 0=3 1=0 -23303=1,1 -23328=1,0 -23329=1,3.168442
Permute                  Transpose_39             1 1 107 output0 0=1 -23328=1,0 -23329=1,3.168442
